In [1]:
import pandas as pd

In [2]:
xls = pd.ExcelFile('Resources/Car_Data.xlsx')
df1 = pd.read_excel(xls, 'Volkswagon')
df2 = pd.read_excel(xls, 'Toyota')
df3 = pd.read_excel(xls, 'Porsche')
df4 = pd.read_excel(xls, 'Mercedes')
df5 = pd.read_excel(xls, 'Maserati')
df6 = pd.read_excel(xls, 'Lincoln')
df7 = pd.read_excel(xls, 'Lexus')
df8 = pd.read_excel(xls, 'Kia')
df9 = pd.read_excel(xls, 'Landrover')
df10 = pd.read_excel(xls, 'Volkswagon')
df11 = pd.read_excel(xls, 'Honda')
df12 = pd.read_excel(xls, 'Hyundai')
df13 = pd.read_excel(xls, 'Acura')
df14 = pd.read_excel(xls, 'Audi')
df15 = pd.read_excel(xls, 'BMW')

In [ ]:
# don't run
appended_data = []
for infile in glob.glob(“data/*.csv”):
    data = pd.read_csv(infile)
    # store DataFrame in list
    appended_data.append(data)
# see pd.concat documentation for more info
appended_data = pd.concat(appended_data)
# write DataFrame to a csv

In [5]:
df1.head()

,auction_code,car_year,color,make,model,subseries,body,engine,transmission,mileage,condition_grade,times_run,sold_date,seller,sale_price
0,KEYA,2001,GREEN,VOLKSWAGEN,JETTA 4C,GLS,4DSN,4G,A,130502.0,NaN,1.0,2017-01-02-00.00.00.000000,5135512.0,450.0
1,AYCA,2009,BLACK,VOLKSWAGEN,TIGUAN AWD,SEL,SUV,4GT,A,96696.0,34,1.0,2017-01-02-00.00.00.000000,5177137.0,7100.0
2,AYCA,2009,SILVER,VOLKSWAGEN,ROUTAN,SE,VAN,6G,A,92321.0,31,1.0,2017-01-02-00.00.00.000000,4925422.0,5800.0
3,AYCA,2014,TAN,VOLKSWAGEN,JETTA 4C,SE,4DSN,4GT,A,70568.0,27,1.0,2017-01-02-00.00.00.000000,4925422.0,4500.0
4,AYCA,2009,BLUE,VOLKSWAGEN,ROUTAN,SE,VAN,6G,A,145625.0,NaN,1.0,2017-01-02-00.00.00.000000,5071209.0,2400.0

In [15]:
clean_df = df1.dropna(how='any')
clean_df.head()

,auction_code,car_year,color,make,model,subseries,body,engine,transmission,mileage,condition_grade,times_run,sold_date,seller,sale_price
1,AYCA,2009,BLACK,VOLKSWAGEN,TIGUAN AWD,SEL,SUV,4GT,A,96696.0,34,1.0,2017-01-02-00.00.00.000000,5177137.0,7100.0
2,AYCA,2009,SILVER,VOLKSWAGEN,ROUTAN,SE,VAN,6G,A,92321.0,31,1.0,2017-01-02-00.00.00.000000,4925422.0,5800.0
3,AYCA,2014,TAN,VOLKSWAGEN,JETTA 4C,SE,4DSN,4GT,A,70568.0,27,1.0,2017-01-02-00.00.00.000000,4925422.0,4500.0
6,NADE,2012,BLACK,VOLKSWAGEN,TIGUAN FWD,LE,SUV,4GT,A,85124.0,38,6.0,2017-01-02-00.00.00.000000,5322633.0,8300.0
7,GOAA,2016,WHITE,VOLKSWAGEN,PASSAT 4C,1.8T S,4DSN,4GT,A,16947.0,46,2.0,2017-01-02-00.00.00.000000,4905415.0,13800.0

In [13]:
clean_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 61251 entries, 1 to 79613
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   auction_code     61251 non-null  object
 1   car_year         61251 non-null  int64
 2   color            61251 non-null  object
 3   make             61251 non-null  object
 4   model            61251 non-null  object
 5   subseries        61251 non-null  object
 6   body             61251 non-null  object
 7   engine           61251 non-null  object
 8   transmission     61251 non-null  object
 9   mileage          61251 non-null  float64
 10  condition_grade  61251 non-null  object
 11  times_run        61251 non-null  float64
 12  sold_date        61251 non-null  object
 13  seller           61251 non-null  float64
 14  sale_price       61251 non-null  float64
dtypes: float64(4), int64(1), object(10)
memory usage: 7.5+ MB